src/cf/DataProcessors/уатПодборНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>уатПодборНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ПодобраннаяНоменклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/уатАналоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатАналоги</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Главный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатЦеныНоменклатурыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатЦеныНоменклатурыКонтрагентов</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.уатАЗС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатРаботыПоРемонту</v8:Type>
						<v8:Type>cfg:CatalogRef.уатМоделиАгрегатов</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/уатПартииТоваровНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатПартииТоваровНаСкладах</Name>
			<Comment>Партии товаров на складах  (уат)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Comment>Стоимость в валюте регламентированного учета без НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьУпр</Name>
					<Comment>Стоимость в валюте управленческого учета без НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в регл. валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.уатВводОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.уатАвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.уатОперацииСТехническимиЖидкостями</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСливГСМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/уатРежимПолученияОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатРежимПолученияОстатков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаТекущуюДату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаДатуДокумента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/уатАЗС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатАЗС</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент_Склад</Name>
					<Comment>Контрагент / склад</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоАЗССклад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлВнешнейОбработки</Name>
					<Comment>Хранилище данных файла внешней обработки</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗагрузкиДанныхОтПЦ</Name>
					<Comment>(уат)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыЗагрузкиДанныхОтПЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьПЦ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатУчетныеЗаписиПЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСтандартнуюОбработкуЗагрузкиДанныхПЦ</Name>
					<Comment>(уат)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильОбменаСПЦ</Name>
					<Comment>(уат)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПрофилиОбменаСВнешнимиСистемами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствиеГСМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГСМизФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГСМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Адреса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПунктНазначения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыКарт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDГруппы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/Склады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Склады</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресноеХранение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСклада</Name>
					<Comment>В решении УЭ не используется, присутствует для совместимости с типовыми решениями</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСкладов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранзитнаяЯчейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделительНаименованияЯчеек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладСнабжения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GDS_ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GDS_Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/уатПодборНоменклатуры/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// начало блока стандартных операций
	ДопПараметрыОткрытие = Новый Структура("ИмяФормы", ИмяФормы);
	уатЗащищенныеФункцииСервер.уатОбработкаФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	// конец блока стандартных операций
	
	ПоказыватьЦены      = Истина;
	ПоказыватьОстатки   = Истина;
	ПоказыватьСчетУчета = Истина;
	ЕстьКоличество      = Истина;
	ПоказыватьДополнительнуюИнформацию = Ложь;
	ПоказыватьПодобранныеТовары = Истина;
	
	СписокСвойств = "ЕстьЦена, Валюта, ДатаРасчетов, ДоговорКонтрагента, Заголовок, ИмяТаблицы, Контрагент, Организация,
		|Подразделение, ПоказыватьОстатки, ПоказыватьЦены, Склад, ПоказыватьСчетУчета, ТипЦен, Услуги, ВидПодбора";
		
	СписокСвойств = СписокСвойств + ?(Параметры.Свойство("ЕстьКоличество"),", ЕстьКоличество","");
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, СписокСвойств);
	
	Если ЗначениеЗаполнено(ТипЦен) Тогда
		ВалютаЦены = ТипЦен.ВалютаЦены;
	КонецЕсли;
	
	Настройки = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить("уатПодборНоменклатуры",);
	Если Настройки <> Неопределено Тогда
		Если Настройки.Свойство("ЗапрашиватьКоличество") Тогда
			ЗапрашиватьКоличество = Настройки.ЗапрашиватьКоличество;
		КонецЕсли;
		Если Настройки.Свойство("ЗапрашиватьЦену") Тогда
			ЗапрашиватьЦену = Настройки.ЗапрашиватьЦену;
		КонецЕсли;
		Если Настройки.Свойство("РежимПолученияОстатков") Тогда
			РежимПолученияОстатков = Настройки.РежимПолученияОстатков;
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаРасчетов) Тогда
		Элементы.РежимПолученияОстатков.Доступность = Ложь;
		РежимПолученияОстатковПред = ?(ЗначениеЗаполнено(РежимПолученияОстатков), РежимПолученияОстатков, Перечисления.уатРежимПолученияОстатков.НаТекущуюДату);
		РежимПолученияОстатков = Перечисления.уатРежимПолученияОстатков.НаТекущуюДату;
		Элементы.РежимПолученияОстатков.СписокВыбора.Очистить();
		Элементы.РежимПолученияОстатков.СписокВыбора.Добавить(Перечисления.уатРежимПолученияОстатков.НаТекущуюДату, Нстр("en = 'as of the current date'; ru = 'на текущую дату'"), Истина);
		Элементы.РежимПолученияОстатков.СписокВыбора.Добавить(Перечисления.уатРежимПолученияОстатков.НаДатуДокумента, Нстр("en = 'as of the date of the document'; ru = 'на дату документа'"), Ложь);
	Иначе
		Элементы.РежимПолученияОстатков.СписокВыбора.Очистить();
		Элементы.РежимПолученияОстатков.СписокВыбора.Добавить(Перечисления.уатРежимПолученияОстатков.НаТекущуюДату, Нстр("en = 'as of the current date'; ru = 'на текущую дату'"));
		Элементы.РежимПолученияОстатков.СписокВыбора.Добавить(Перечисления.уатРежимПолученияОстатков.НаДатуДокумента, Нстр("en = 'as of the date of the document ('; ru = 'на дату документа ('") + Строка(ДатаРасчетов) + ")");
		Если Не ЗначениеЗаполнено(РежимПолученияОстатков) Тогда
			РежимПолученияОстатков = Перечисления.уатРежимПолученияОстатков.НаТекущуюДату;
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.Заголовок) Тогда
		Заголовок = Параметры.Заголовок;
		АвтоЗаголовок = Ложь;
	КонецЕсли;
	
	// Если в заявке на ремонт или ремонтном листе была указана собственная ремонтная зона и склад, то выводим только
	// остатки на нем
	Если ЗначениеЗаполнено(Параметры.Склад) Тогда
		СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("Склад", Параметры.Склад);
		ПоказыватьТолькоОстатки = Истина;
	КонецЕсли;
	
	// Колонки надо "отключить" ДО выполнения запроса в СписокНоменклатуры, в противном случае
	//  в запросе произойдёт левое соединение с таблицей цен и строки задвоятся.
	// Если указывать условия только в условном оформлении, то они не успеют сработать до выполнения запроса.
	Если НЕ ПоказыватьЦены Тогда
		Элементы.СписокНоменклатурыЦена.Видимость   = Ложь;
		Элементы.СписокНоменклатурыВалюта.Видимость = Ложь;
	КонецЕсли;
	//Если НЕ ЭтотОбъект.ПоказыватьСчетУчета Тогда
	//	Элементы.СписокНоменклатурыСчетУчета.Видимость = Ложь;
	//КонецЕсли;
	Если НЕ ПоказыватьОстатки Тогда
		Элементы.СписокНоменклатурыКоличествоОстаток.Видимость = Ложь;
	КонецЕсли;
	Элементы.ГруппаПоказыватьТолькоОстатки.Видимость = ПоказыватьОстатки;
	
	Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
		СкладСнабжения = Склад.СкладСнабжения;
	КонецЕсли;
	Элементы.СкладСнабжения.Видимость = ЗначениеЗаполнено(СкладСнабжения);
	Элементы.СписокНоменклатурыКоличествоОстатокСнабжение.Видимость = ЗначениеЗаполнено(СкладСнабжения);

	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("Организация", Организация);
	Если ЗначениеЗаполнено(Организация) Тогда
		Если уатОбщегоНазначения.УчетнаяПолитика(Организация,
			?(ЗначениеЗаполнено(ДатаРасчетов), ДатаРасчетов, ТекущаяДата())).УчетПартийПоОрганизациям Тогда
			
			Элементы.СписокНоменклатурыКоличествоОстатокОрганизация.Видимость = Истина;
			Элементы.СписокНоменклатурыКоличествоОстатокОрганизация.Заголовок = "Остаток (" + Организация + ")";
		КонецЕсли;
	КонецЕсли;
	
	УправлениеСписком();

	Элементы.ПоказыватьТолькоОстатки.Заголовок = Нстр("en = 'Only in stock at'; ru = 'Только в наличии'") +
		?(ЗначениеЗаполнено(Параметры.Склад), СтрШаблон(Нстр("en = '""%1"" warehouse'; ru = ' на складе ""%1""'"), Параметры.Склад), Нстр("en = ' all warehouses'; ru = ' на всех складах'"));
		
	ТекущийЭлемент = Элементы.СтрокаПоиска;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// начало блока стандартных операций
	уатЗащищенныеФункцииКлиент.уатОбработкаФормаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	// конец блока стандартных операций
	
	Если СтрНайти(ВладелецФормы.ИмяФормы, "ПечатьЭтикеток") <> 0 Тогда
        ОсновнаяОрганизация = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
			ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяОрганизация");
		ВалютаРегл = уатОбщегоНазначенияТиповые.ВалютаРегламентированногоУчета(ОсновнаяОрганизация);
		ДопПараметрыКурса = Новый Структура("БазоваяВалюта, ДатаКурса, Источник",
			ВалютаРегл, ТекущаяДата(), уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(ОсновнаяОрганизация, "ОсновнойБанк"));
	Иначе
		ДопПараметрыКурса = уатОбщегоНазначенияТиповыеКлиент.ДопПараметрыКурсаВалюты(ВладелецФормы.Объект);
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда 
		Возврат;
		
	Иначе 
		Если Не ПеренестиВДокумент И Объект.ПодобраннаяНоменклатура.Количество() > 0 Тогда
			Отказ = Истина;
			ТекстНСТР = НСтр("en='Selected goods are not transferred to document."
""
"Transfer?';ru='Подобранные товары не перенесены в документ."
""
"Перенести?'");
			ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), ТекстНСТР, РежимДиалогаВопрос.ДаНетОтмена);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    ОтветНаВопрос = РезультатВопроса;
    
	Если ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
		Объект.ПодобраннаяНоменклатура.Очистить();
		Закрыть();   
    ИначеЕсли ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
        ПеренестиВДокумент = Истина;
		Закрыть();
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда 
		Возврат;
	КонецЕсли;
	
	СтруктураВозврата = ПриЗакрытииНаСервере();
		
	Если ПеренестиВДокумент Тогда
		ОповеститьОВыборе(СтруктураВозврата);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказыватьТолькоОстаткиПриИзменении(Элемент)
	
	УстановитьЗначениеПараметраПоказыватьТолькоОстаткиСпискаНоменклатуры();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПолученияОстатковПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(ДатаРасчетов)
		Или РежимПолученияОстатков = ПредопределенноеЗначение("Перечисление.уатРежимПолученияОстатков.НаТекущуюДату") Тогда
		ДатаОстатки = Неопределено;
	Иначе
		ДатаОстатки = ДатаРасчетов;
	КонецЕсли;
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("ДатаОстатки", ДатаОстатки);
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПодобранныеТоварыНажатие(Элемент)
	ПоказыватьПодобранныеТовары = Ложь;
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПодобранныеТоварыНажатие(Элемент)
	ПоказыватьПодобранныеТовары = Истина;
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура СкрытьДополнительнуюИнформациюНажатие(Элемент)
	ПоказыватьДополнительнуюИнформацию = Ложь;
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДополнительнуюИнформациюНажатие(Элемент)
	ПоказыватьДополнительнуюИнформацию = Истина;
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура СкладСнабженияПриИзменении(Элемент)
	УправлениеСписком();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыИерархияНоменклатуры

&НаКлиенте
Процедура ИерархияНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	УстановитьОтборПоИерархииНоменклатуры(ВыбраннаяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ИерархияНоменклатурыПриАктивизацииСтроки(Элемент)

	УстановитьОтборПоИерархииНоменклатуры(Элементы.ИерархияНоменклатуры.ТекущаяСтрока);

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНоменклатуры

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Элемент.ВыделенныеСтроки.Количество() > 1 Тогда
		Элемент.ВыделенныеСтроки.Очистить();
		Элемент.ВыделенныеСтроки.Добавить(Элемент.ТекущаяСтрока);
	КонецЕсли;
	СовершитьВыбор(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СписокНоменклатурыВыбор(Элемент, Значение, , СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		АналогиНоменклатуры.Очистить();
		Возврат;
	КонецЕсли;
	
	Если ПоказыватьДополнительнуюИнформацию Тогда
		ПараметрыПолученияАналогов = Новый Структура;
		ПараметрыПолученияАналогов.Вставить("Номенклатура", ТекущиеДанные.НоменклатураСсылка);
		Если ПоказыватьОстатки Тогда
			ПараметрыПолученияАналогов.Вставить("ПолучатьОстатки", Истина);
			ПараметрыПолученияАналогов.Вставить("ДатаРасчетов", ДатаРасчетов);
			Если Не ЗначениеЗаполнено(ДатаРасчетов)
				Или РежимПолученияОстатков = ПредопределенноеЗначение("Перечисление.уатРежимПолученияОстатков.НаТекущуюДату") Тогда
				ДатаОстатки = Неопределено;
			Иначе
				ДатаОстатки = ДатаРасчетов;
			КонецЕсли;
			ПараметрыПолученияАналогов.Вставить("ДатаОстатки", ДатаОстатки);
			ПараметрыПолученияАналогов.Вставить("Склад", Склад);
		КонецЕсли;
		Если ПоказыватьЦены И ЕстьЦена Тогда
			ПараметрыПолученияАналогов.Вставить("ПолучатьЦены", Истина);
			ПараметрыПолученияАналогов.Вставить("Контрагент", Контрагент);
		КонецЕсли;
		мсвАналоги = ПолучитьАналогиНоменклатуры(ПараметрыПолученияАналогов);
		АналогиНоменклатуры.Очистить();
		Для Каждого СтрокаАналог Из мсвАналоги Цикл
			НоваяСтрока = АналогиНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаАналог);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ВыделенныеСтроки = Новый Массив;
	ИтоговыйМассивВыделенныхСтрок = Новый Массив;
	
	Для Каждого ТекСтр Из Элемент.ВыделенныеСтроки Цикл
		ВыделенныеСтроки.Добавить(ТекСтр);
	КонецЦикла;
	
	Для каждого ТекСтрокаПеретаскивания Из ВыделенныеСтроки Цикл
		
		Элемент.ТекущаяСтрока = ТекСтрокаПеретаскивания;
		ТекущиеДанныеСтрокиПеретаскивания = Элемент.ТекущиеДанные;
		
		СтруктураПараметрыНоменклатуры = Новый Структура();
		СтруктураПараметрыНоменклатуры.Вставить("Номенклатура", ТекущиеДанныеСтрокиПеретаскивания.НоменклатураСсылка);
		Если ЕстьЦена И ПоказыватьЦены Тогда
			СтруктураПараметрыНоменклатуры.Вставить("Цена", ТекущиеДанныеСтрокиПеретаскивания.Цена);
			СтруктураПараметрыНоменклатуры.Вставить("Валюта", ТекущиеДанныеСтрокиПеретаскивания.Валюта);
		КонецЕсли;
		
		ИтоговыйМассивВыделенныхСтрок.Добавить(СтруктураПараметрыНоменклатуры);
		
	КонецЦикла;
	
	ПараметрыПеретаскивания.Значение = ИтоговыйМассивВыделенныхСтрок;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАналогиНоменклатуры

&НаКлиенте
Процедура АналогиНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	СтруктураПараметрыНоменклатуры = ПолучитьСтруктуруПараметрыНоменклатуры(Элемент, "Аналог");
	Если СтруктураПараметрыНоменклатуры <> Неопределено Тогда
		ПодобратьНоменклатуру(СтруктураПараметрыНоменклатуры);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АналогиНоменклатурыВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	АналогиНоменклатурыВыбор(Элемент, Значение, , СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура АналогиНоменклатурыНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	СтруктураПараметрыНоменклатуры = Новый Структура();
	СтруктураПараметрыНоменклатуры.Вставить("Номенклатура", Элемент.ТекущиеДанные.Аналог);
	Если ЕстьЦена И ПоказыватьЦены Тогда
		СтруктураПараметрыНоменклатуры.Вставить("Цена", Элемент.ТекущиеДанные.Цена);
		СтруктураПараметрыНоменклатуры.Вставить("Валюта", Элемент.ТекущиеДанные.Валюта);
	КонецЕсли;
	
	ПараметрыПеретаскивания.Значение = СтруктураПараметрыНоменклатуры;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПодобраннаяНоменклатура

&НаКлиенте
Процедура ПодобраннаяНоменклатураПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)

	Отказ = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПодобраннаяНоменклатураКоличествоПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ПодобраннаяНоменклатура.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;

КонецПроцедуры

&НаКлиенте
Процедура ПодобраннаяНоменклатураЦенаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ПодобраннаяНоменклатура.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;

КонецПроцедуры

&НаКлиенте
Процедура ПодобраннаяНоменклатураСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПодобраннаяНоменклатура.ТекущиеДанные;
	Если ТекущиеДанные.Количество = 0 Тогда
		ТекущиеДанные.Цена = 0;
	Иначе
		ТекущиеДанные.Цена = ТекущиеДанные.Сумма / ТекущиеДанные.Количество;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобраннаяНоменклатураПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ПодобратьНоменклатуру(ПараметрыПеретаскивания.Значение);
КонецПроцедуры

&НаКлиенте
Процедура ПодобраннаяНоменклатураПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Структура") 
		Или ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("ДанныеФормыЭлементКоллекции") Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)

	ПеренестиВДокумент = Истина;
	Закрыть(КодВозвратаДиалога.OK);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиПодбора(Команда)

	ПараметрыФормы = Новый Структура("ЕстьЦена, ЕстьКоличество", ЕстьЦена, ЕстьКоличество);
	Результат = Неопределено;

	ОткрытьФорму("Обработка.уатПодборНоменклатуры.Форма.НастройкиПодбора", ПараметрыФормы, ЭтотОбъект,,,, Новый ОписаниеОповещения("ОткрытьФормуНастройкиПодбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиПодбораЗавершение(Результат1, ДополнительныеПараметры) Экспорт
    
    Результат = Результат1;
    Если Результат <> Неопределено Тогда
        ЗапрашиватьКоличество = Результат.ЗапрашиватьКоличество;
        ЗапрашиватьЦену       = Результат.ЗапрашиватьЦену;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	СовершитьВыбор(Элементы.СписокНоменклатуры);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеСписком()

	ДатаЦены = ?(НЕ ЗначениеЗаполнено(ДатаРасчетов), ТекущаяДатаСеанса(), ДатаРасчетов);
	Если Не ЗначениеЗаполнено(ДатаРасчетов)
		Или РежимПолученияОстатков = ПредопределенноеЗначение("Перечисление.уатРежимПолученияОстатков.НаТекущуюДату") Тогда
		ДатаОстатки = Неопределено;
	Иначе
		ДатаОстатки = ДатаРасчетов;
	КонецЕсли;

	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокНоменклатуры, "ТипЦен", ТипЦен, ЗначениеЗаполнено(ТипЦен));
	
	ИспользоватьОтборПоСкладу 		= Истина;
	ИспользоватьОтборПоСчетуНеГТД 	= Истина;

	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("ДатаОстатки"  	, ДатаОстатки);
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("ДатаЦены"  	    , ДатаЦены);
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("Контрагент"  	    , Контрагент);
	УстановитьЗначениеПараметраПоказыватьТолькоОстаткиСпискаНоменклатуры();
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокНоменклатуры, "НоменклатураСсылка.Услуга",
		Услуги, ТипЗнч(Услуги) = Тип("Булево"));

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоИерархииНоменклатуры(ГруппаНоменклатуры)

	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокНоменклатуры, "НоменклатураСсылка",
		ГруппаНоменклатуры, ЗначениеЗаполнено(ГруппаНоменклатуры), ВидСравненияКомпоновкиДанных.ВИерархии);

КонецПроцедуры

&НаСервере
Функция ПоместитьПодобраннуюНоменклатуруВХранилище()

	ТаблицаНоменклатуры = Объект.ПодобраннаяНоменклатура.Выгрузить();

	АдресПодобраннойНоменклатурыВХранилище = ПоместитьВоВременноеХранилище(ТаблицаНоменклатуры, УникальныйИдентификатор);

	Возврат АдресПодобраннойНоменклатурыВХранилище;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЦенуПослеПересчета(Знач Цена, Знач ВалютаНач, Знач ВалютаКон, Знач ДатаПересчета, Знач ДопПараметрыКурса)

	Возврат уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(Цена,
		ВалютаНач, ВалютаКон, ДатаПересчета, ДатаПересчета,,,,
		ДопПараметрыКурса);

КонецФункции

&НаСервере
Процедура УстановитьЗначениеПараметраПоказыватьТолькоОстаткиСпискаНоменклатуры()
	
	ЗначениеПараметра = ПоказыватьТолькоОстатки И ПоказыватьОстатки;
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("ПоказыватьТолькоОстатки", ЗначениеПараметра);
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("Склад", Склад);
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("СкладСнабжения", СкладСнабжения);
	
КонецПроцедуры

&НаСервере
Функция ПриЗакрытииНаСервере()

	СтруктураВозврата = Новый Структура();

	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ЗапрашиватьКоличество"     , ЗапрашиватьКоличество);
	ПараметрыЗакрытия.Вставить("ЗапрашиватьЦену"           , ЗапрашиватьЦену);
	Если Элементы.РежимПолученияОстатков.Доступность Тогда
		ПараметрыЗакрытия.Вставить("РежимПолученияОстатков", РежимПолученияОстатков);
	Иначе
		ПараметрыЗакрытия.Вставить("РежимПолученияОстатков", РежимПолученияОстатковПред);
	КонецЕсли;
	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("уатПодборНоменклатуры", , ПараметрыЗакрытия);

	Если ПеренестиВДокумент Тогда
		АдресПодобраннойНоменклатурыВХранилище = ПоместитьПодобраннуюНоменклатуруВХранилище();
		СтруктураВозврата.Вставить("АдресПодобраннойНоменклатурыВХранилище", АдресПодобраннойНоменклатурыВХранилище);
	КонецЕсли;
	
	Возврат СтруктураВозврата;

КонецФункции

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.ПоказатьПодобранныеТовары.Видимость = Не ПоказыватьПодобранныеТовары;
	Элементы.СкрытьПодобранныеТовары.Видимость = ПоказыватьПодобранныеТовары;
	Элементы.ПодобраннаяНоменклатура.Видимость = ПоказыватьПодобранныеТовары;
	
	Элементы.ПоказатьДополнительнуюИнформацию.Видимость = Не ПоказыватьДополнительнуюИнформацию;
	Элементы.СкрытьДополнительнуюИнформацию.Видимость = ПоказыватьДополнительнуюИнформацию;
	Элементы.АналогиНоменклатуры.Видимость = ПоказыватьДополнительнуюИнформацию;
	
	Элементы.АналогиНоменклатурыКоличествоОстаток.Видимость = ПоказыватьОстатки;
	
	Элементы.АналогиНоменклатурыВалюта.Видимость = ПоказыватьЦены;
	Элементы.АналогиНоменклатурыЦена.Видимость = ПоказыватьЦены;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАналогиНоменклатуры(ПараметрыПолученияАналогов)
	Если Не ТипЗнч(ПараметрыПолученияАналогов) = Тип("Структура") Тогда
		Результат = Новый Массив;
		Возврат Результат;
	КонецЕсли;
		
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	уатАналоги.Аналог КАК Аналог,
	|	уатАналоги.Аналог.Артикул КАК АналогАртикул,
	|	уатАналоги.Главный КАК Главный,
	|	""Прямой"" КАК ПрямойАналог
	|ПОМЕСТИТЬ втАналоги
	|ИЗ
	|	РегистрСведений.уатАналоги КАК уатАналоги
	|ГДЕ
	|	уатАналоги.Номенклатура = &Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	уатАналоги.Номенклатура,
	|	уатАналоги.Номенклатура.Артикул,
	|	ЛОЖЬ,
	|	""Обратный""
	|ИЗ
	|	РегистрСведений.уатАналоги КАК уатАналоги
	|ГДЕ
	|	уатАналоги.Аналог = &Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////";

	Если ПараметрыПолученияАналогов.Свойство("ПолучатьЦены") Тогда
		Запрос.Текст = Запрос.Текст + "
		|	ВЫБРАТЬ
		|	уатЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура КАК Номенклатура,
		|	уатЦеныНоменклатурыКонтрагентовСрезПоследних.Валюта КАК Валюта,
		|	уатЦеныНоменклатурыКонтрагентовСрезПоследних.Цена КАК Цена,
		|	ВЫБОР
		|		КОГДА уатЦеныНоменклатурыКонтрагентовСрезПоследних.Контрагент = &Контрагент
		|			ТОГДА 1
		|		КОГДА уатЦеныНоменклатурыКонтрагентовСрезПоследних.Контрагент = Значение(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА 2
		|		КОГДА уатЦеныНоменклатурыКонтрагентовСрезПоследних.Контрагент = Значение(Справочник.уатАЗС.ПустаяСсылка)
		|			ТОГДА 3
		|		ИНАЧЕ 4
		|	КОНЕЦ КАК Приоритет
		|ПОМЕСТИТЬ втЦены
		|ИЗ
		|	РегистрСведений.уатЦеныНоменклатурыКонтрагентов.СрезПоследних(
		|			&ДатаЦены,
		|			(Контрагент = &Контрагент
		|				ИЛИ Контрагент = Значение(Справочник.Контрагенты.ПустаяСсылка)
		|				ИЛИ Контрагент = Значение(Справочник.уатАЗС.ПустаяСсылка)
		|				ИЛИ Контрагент = НЕОПРЕДЕЛЕНО)
		|				И Номенклатура В
		|					(ВЫБРАТЬ
		|						втАналоги.Аналог
		|					ИЗ
		|						втАналоги КАК втАналоги)) КАК уатЦеныНоменклатурыКонтрагентовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЦены.Номенклатура КАК Номенклатура,
		|	МИНИМУМ(втЦены.Приоритет) КАК Приоритет
		|ПОМЕСТИТЬ втПриоритеты
		|ИЗ
		|	втЦены КАК втЦены
		|
		|СГРУППИРОВАТЬ ПО
		|	втЦены.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЦены.Номенклатура КАК Номенклатура,
		|	втЦены.Валюта КАК Валюта,
		|	втЦены.Цена КАК Цена,
		|	втПриоритеты.Приоритет КАК Приоритет
		|ПОМЕСТИТЬ втЦеныСПриоритетами
		|ИЗ
		|	втЦены КАК втЦены
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПриоритеты КАК втПриоритеты
		|		ПО втЦены.Номенклатура = втПриоритеты.Номенклатура
		|			И втЦены.Приоритет = втПриоритеты.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////"
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|ВЫБРАТЬ
	|	втАналоги.Аналог КАК Аналог,
	|	втАналоги.АналогАртикул КАК АналогАртикул,
	|	МАКСИМУМ(втАналоги.Главный) КАК Главный,";
	Если ПараметрыПолученияАналогов.Свойство("ПолучатьОстатки") Тогда
		Запрос.Текст = Запрос.Текст + "
		|	МАКСИМУМ(уатПартииТоваровНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток,";
	КонецЕсли;
	Если ПараметрыПолученияАналогов.Свойство("ПолучатьЦены") Тогда
		Запрос.Текст = Запрос.Текст + "
		|		МАКСИМУМ(ЕСТЬNULL(втЦеныСПриоритетами.Цена, 0)) КАК Цена,
		|		МАКСИМУМ(ЕСТЬNULL(втЦеныСПриоритетами.Валюта, НЕОПРЕДЕЛЕНО)) КАК Валюта,";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(втАналоги.ПрямойАналог) <> МИНИМУМ(втАналоги.ПрямойАналог)
	|			ТОГДА ""Взаимный""
	|		ИНАЧЕ МАКСИМУМ(втАналоги.ПрямойАналог)
	|	КОНЕЦ КАК ПрямойАналог
	|ИЗ
	|	втАналоги КАК втАналоги";
	Если ПараметрыПолученияАналогов.Свойство("ПолучатьОстатки") Тогда
		Запрос.Текст = Запрос.Текст + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уатПартииТоваровНаСкладах.Остатки(
		|				&ДатаОстатки,
		|				Номенклатура В
		|					(ВЫБРАТЬ
		|						втАналоги.Аналог
		|					ИЗ
		|						втАналоги КАК втАналоги)
		|				И ВЫБОР
		|					КОГДА &Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|						ТОГДА Склад = &Склад
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК уатПартииТоваровНаСкладахОстатки
		|		ПО втАналоги.Аналог = уатПартииТоваровНаСкладахОстатки.Номенклатура";
	КонецЕсли;
	Если ПараметрыПолученияАналогов.Свойство("ПолучатьЦены") Тогда
		Запрос.Текст = Запрос.Текст + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ втЦеныСПриоритетами КАК втЦеныСПриоритетами
		|		ПО втАналоги.Аналог = втЦеныСПриоритетами.Номенклатура";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|
	|СГРУППИРОВАТЬ ПО
	|	втАналоги.Аналог,
	|	втАналоги.АналогАртикул
	|	
	|УПОРЯДОЧИТЬ ПО
	|	Главный УБЫВ";
	Запрос.УстановитьПараметр("Номенклатура", ПараметрыПолученияАналогов.Номенклатура);
	Если ПараметрыПолученияАналогов.Свойство("ПолучатьОстатки") Тогда
		Запрос.УстановитьПараметр("ДатаОстатки", ПараметрыПолученияАналогов.ДатаОстатки);
	КонецЕсли;
	Если ПараметрыПолученияАналогов.Свойство("Склад") Тогда
		Запрос.УстановитьПараметр("Склад", ПараметрыПолученияАналогов.Склад);
	Иначе
		Запрос.УстановитьПараметр("Склад", Справочники.Склады.ПустаяСсылка());
	КонецЕсли;
	Если ПараметрыПолученияАналогов.Свойство("ПолучатьЦены") Тогда 
		ДатаЦены = ?(НЕ ЗначениеЗаполнено(ПараметрыПолученияАналогов.ДатаРасчетов), ТекущаяДатаСеанса(), ПараметрыПолученияАналогов.ДатаРасчетов);
		Запрос.УстановитьПараметр("ДатаЦены", ДатаЦены);
		Запрос.УстановитьПараметр("Контрагент", ПараметрыПолученияАналогов.Контрагент);
	КонецЕсли;
	тблАналоги = Запрос.Выполнить().Выгрузить();
	Результат = уатОбщегоНазначенияСервер.ПреобразоватьТаблицувМассивСтрок(тблАналоги);
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ПодобратьНоменклатуру(МассивНоменклатуры)
	
	МножественныйВыбор = Ложь;
	
	Если ТипЗнч(МассивНоменклатуры) = Тип("Структура") Тогда
		НовыйМассивНоменклатуры = Новый Массив;
		НовыйМассивНоменклатуры.Добавить(МассивНоменклатуры);
		МассивНоменклатуры = НовыйМассивНоменклатуры;
	КонецЕсли;
	
	Если МассивНоменклатуры.Количество() = 1 Тогда
		СтруктураПараметрыНоменклатуры = МассивНоменклатуры[0];
	Иначе
		МножественныйВыбор = Истина;
	КонецЕсли;
	
	Количество = 1;
	
	Если ЗапрашиватьКоличество и ЕстьКоличество ИЛИ ЗапрашиватьЦену И ЕстьЦена Тогда
		Если Не МножественныйВыбор Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Номенклатура"  , СтруктураПараметрыНоменклатуры.Номенклатура);
			ПараметрыФормы.Вставить("Цена"          , ?(СтруктураПараметрыНоменклатуры.Свойство("Цена"), СтруктураПараметрыНоменклатуры.Цена, 0));
			ПараметрыФормы.Вставить("Количество"    , 1);
			ПараметрыФормы.Вставить("Валюта"        , Валюта);
			ПараметрыФормы.Вставить("ЕстьЦена"      , ЗапрашиватьЦену И ЕстьЦена);
			ПараметрыФормы.Вставить("ЕстьКоличество", ЗапрашиватьКоличество И ЕстьКоличество);
			
			ОткрытьФорму("Обработка.уатПодборНоменклатуры.Форма.ФормаВводаЦенаКоличество", ПараметрыФормы, ЭтотОбъект,,,,
			Новый ОписаниеОповещения("ПодобратьНоменклатуруЗавершение", ЭтотОбъект,
			Новый Структура("СтруктураПараметрыНоменклатуры", СтруктураПараметрыНоменклатуры)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Возврат;
		ИначеЕсли МножественныйВыбор И ЗапрашиватьКоличество и ЕстьКоличество Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Номенклатура"  , ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
			ПараметрыФормы.Вставить("Количество"    , 1);
			ПараметрыФормы.Вставить("ЕстьКоличество", ЗапрашиватьКоличество И ЕстьКоличество);
			
			ОткрытьФорму("Обработка.уатПодборНоменклатуры.Форма.ФормаВводаЦенаКоличество", ПараметрыФормы, ЭтотОбъект,,,,
			Новый ОписаниеОповещения("МножественноПодобратьНоменклатуруЗавершение", ЭтотОбъект,
			Новый Структура("МассивНоменклатуры", МассивНоменклатуры)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Для каждого СтрокаПараметрыНоменклатуры Из МассивНоменклатуры Цикл
		ПодобратьНоменклатуруФрагмент(Количество, СтрокаПараметрыНоменклатуры);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МножественноПодобратьНоменклатуруЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Для каждого ТекСтрока Из ДополнительныеПараметры.МассивНоменклатуры Цикл
			ПодобратьНоменклатуруФрагмент(Результат.Количество, ТекСтрока);
		КонецЦикла;
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьНоменклатуруЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ДополнительныеПараметры.СтруктураПараметрыНоменклатуры.Вставить("Цена", Результат.Цена);
		Количество = Результат.Количество;
	Иначе
		Возврат;
	КонецЕсли;
	
	ПодобратьНоменклатуруФрагмент(Количество, ДополнительныеПараметры.СтруктураПараметрыНоменклатуры);

КонецПроцедуры

&НаКлиенте
Процедура ПодобратьНоменклатуруФрагмент(Знач Количество, Знач СтруктураПараметрыНоменклатуры)
	
	Перем ПараметрыПоиска, РезультатПоиска, ТекущаяСтрока;
	
	Если СтруктураПараметрыНоменклатуры.Свойство("Цена") Тогда
		ПараметрыПоиска = Новый Структура("Номенклатура, Цена",
		СтруктураПараметрыНоменклатуры.Номенклатура, СтруктураПараметрыНоменклатуры.Цена);
	Иначе
		ПараметрыПоиска = Новый Структура("Номенклатура", СтруктураПараметрыНоменклатуры.Номенклатура);
	КонецЕсли;
	
	РезультатПоиска = Объект.ПодобраннаяНоменклатура.НайтиСтроки(ПараметрыПоиска);
	Если РезультатПоиска.Количество() = 0 Тогда
		ТекущаяСтрока = Объект.ПодобраннаяНоменклатура.Добавить();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтруктураПараметрыНоменклатуры);
	Иначе
		ТекущаяСтрока = РезультатПоиска[0];
	КонецЕсли;
	
	ТекущаяСтрока.Количество = Количество + ТекущаяСтрока.Количество;
	
	Если СтруктураПараметрыНоменклатуры.Свойство("Цена") Тогда
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	КонецЕсли;
	
	// Активизируем текущую строку табличной части
	Элементы.ПодобраннаяНоменклатура.ТекущаяСтрока = ТекущаяСтрока.ПолучитьИдентификатор();

КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруПараметрыНоменклатуры(Элемент, ИмяПоляНоменклатуры)
	
	КоличествоСтрок = Элемент.ВыделенныеСтроки.Количество();
	МассивНоменклатуры = Новый Массив;
	Для каждого СтрокаВыбраннойНоменклатуры Из Элемент.ВыделенныеСтроки Цикл
		
		СтруктураПараметрыНоменклатуры = Неопределено;
		Если СтрокаВыбраннойНоменклатуры <> Неопределено Тогда
			СтруктураПараметрыНоменклатуры = Новый Структура;
			СтруктураПараметрыНоменклатуры.Вставить("Номенклатура", Элемент.ДанныеСтроки(СтрокаВыбраннойНоменклатуры)[ИмяПоляНоменклатуры]);
			Если Элемент.ДанныеСтроки(СтрокаВыбраннойНоменклатуры).Свойство("Валюта") Тогда
				Если ЗначениеЗаполнено(Элемент.ДанныеСтроки(СтрокаВыбраннойНоменклатуры).Валюта) Тогда
					СтруктураПараметрыНоменклатуры.Вставить("Валюта", Элемент.ДанныеСтроки(СтрокаВыбраннойНоменклатуры).Валюта);
				Иначе
					СтруктураПараметрыНоменклатуры.Вставить("Валюта", ВалютаЦены);
				КонецЕсли;
			КонецЕсли;
			Если Элемент.ДанныеСтроки(СтрокаВыбраннойНоменклатуры).Свойство("Цена") Тогда
				Если СтруктураПараметрыНоменклатуры.Свойство("Валюта")
					И ЗначениеЗаполнено(СтруктураПараметрыНоменклатуры.Валюта)
					И ЗначениеЗаполнено(Валюта)
					И СтруктураПараметрыНоменклатуры.Валюта <> Валюта Тогда
					
					
					Цена = ПолучитьЦенуПослеПересчета(Элемент.ДанныеСтроки(СтрокаВыбраннойНоменклатуры).Цена,
						СтруктураПараметрыНоменклатуры.Валюта, Валюта, ДатаРасчетов, ДопПараметрыКурса);
						
					СтруктураПараметрыНоменклатуры.Вставить("Цена",   Цена);
					СтруктураПараметрыНоменклатуры.Вставить("Валюта", Валюта);
				Иначе
					СтруктураПараметрыНоменклатуры.Вставить("Цена", Элемент.ДанныеСтроки(СтрокаВыбраннойНоменклатуры).Цена);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		МассивНоменклатуры.Добавить(СтруктураПараметрыНоменклатуры);
		
	КонецЦикла;
	
	Возврат МассивНоменклатуры;
	
КонецФункции

&НаКлиенте
Процедура СовершитьВыбор(Таблица)
	МассивНоменклатуры = ПолучитьСтруктуруПараметрыНоменклатуры(Таблица, "НоменклатураСсылка");
	Если МассивНоменклатуры.Количество() <> 0 Тогда
		ПодобратьНоменклатуру(МассивНоменклатуры);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
